{"pages":[{"title":"Contact","text":"Contact me for questions, comments, suggestions, for Ninjutsu OS. Email: Message: Submit window.addEventListener(\"DOMContentLoaded\", function() { // get the form elements defined in your form HTML above var form = document.getElementById(\"my-form\"); var button = document.getElementById(\"my-form-button\"); var status = document.getElementById(\"my-form-status\"); // Success and Error functions for after the form is submitted function success() { form.reset(); button.style = \"display: none \"; status.innerHTML = \"Thanks!\"; } function error() { status.innerHTML = \"Oops! There was a problem.\"; } // handle the form submission event form.addEventListener(\"submit\", function(ev) { ev.preventDefault(); var data = new FormData(form); ajax(form.method, form.action, data, success, error); }); }); // helper function for sending an AJAX request function ajax(method, url, data, success, error) { var xhr = new XMLHttpRequest(); xhr.open(method, url); xhr.setRequestHeader(\"Accept\", \"application/json\"); xhr.onreadystatechange = function() { if (xhr.readyState !== XMLHttpRequest.DONE) return; if (xhr.status === 200) { success(xhr.response, xhr.responseType); } else { error(xhr.status, xhr.response, xhr.responseType); } }; xhr.send(data); }","link":"/Contact/index.html"},{"title":"Download","text":"Download :MEGA : Soon","link":"/Download/index.html"},{"title":"FAQ","text":"Latest update (23/05/2020)How To Fix Windows 10 Login Problems ?(We can’t sign into Ninjutsu) If you’re not able to signed in Ninjutsu OS, you should follow this procedures below : Notes : By default Safe Mode and System Restore Points are enabled in Ninjutsu OS , So this can help and assist in the troubleshooting process. Restart safe mode1- Restart your computer by Hold down the shift key and click Restart. 2- Click the option Troubleshoot and then Advanced options. 3- Go to “Advanced options” and click Start-up Settings. 4- Under “Start-up Settings” click Restart. 5- A window with various startup options will show up. The relevant options for booting in Safe Mode are numbers, 4 6- Enable Safe ModeIn this mode, the operating system is started with the bare minimum of installed drivers and only the main Windows functions are used. 7- Windows 10 starts in Safe Mode. Your Ninjutsu Password is : toor Disable Automatic Login Using netplwizPress the Windows key + R to open the Run box. Type ‘netplwiz’ and press Enter. The User Accounts dialog box will appear. From there you can easily turn on / off Windows automatic login. Turn Off Automatic Login: If you want to turn off automatic login, check the “Users must enter a username and password to use this computer” option and click Apply, you’re done. Restart your computer and the system will prompt you to enter password at the login screen. Restart your PC and when Windows loads it ask you to enter your password. Blue screen Crash after install Docker or running Nox emulator If you wish to use Nox emulator or VirtualBox or any other executable that uses a Type-2 hypervisor, you should disable Hyper-V and restart your computer first. How to disable Hyper-V :Open a new command prompt as an administrator and type the following: 1bcdedit /set hypervisorlaunchtype off After restarting your device, you should be able to use Nox emulator and VirtualBox as usual. If you wish to use Docker again, you should enable Hyper-V and restart your machine. How to Enable Hyper-V :Open a new command prompt as an administrator and type the following: 1bcdedit /set hypervisorlaunchtype auto Restart, and now you’re ready to run and deploy containers to Docker How to Change Display Language in Windows 10Changing system languageTo change the system language on Windows 10, close any running app, and then use these steps: 1- Open Settings. 2- Click on Time &amp; Language. 3- Click on Language. 4- Under the “Preferred languages” section, click the Add a preferred language button. 5- Search for the language you want on Windows 10. 6- Select the language package from the result. for example i would like to change my windows to arabic Language 7- Click the Next button. 8- Check the Set as my display language option. 9- Check the Install language pack option. 10- Check or clear the additional language features as needed. 11- Click the Install button. 12- Click the Yes, sign out now button. 13- Sign back into the Windows 10 account. After you complete the steps, the language will change across the entire Windows 10 experience. The new changes will be reflected in the Sign-in screen, Settings app, File Explorer, Desktop, apps, browser, and websites you visit. Also, depending on your new settings, Windows 10 may prompt you to review your privacy settings again.","link":"/FAQ/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"community","text":"Community Twitter : https://twitter.com/ninjutsu_os Telegram : https://t.me/Ninjutsu_os Discord : https://discord.gg/ySmjw9 GitHub : https://github.com/Ninjutsu-OS/Ninjutsu","link":"/community/index.html"},{"title":"donate","text":"DonationI love to share my project and it takes me a lot of thought and time. I do it because I know how it’s hard to build a penetration testing environment &amp; I think it’s important to share my knowledge and give back to the community as many have done before me. For everyone who would like to support the Ninjutsu Project, Your support is greatly appreciated to Ninjutsu project and help us develop new versions of the system.There are Paypal/BuymeCoffe button below for give a single donation, You can support my on-going work via monthly instalments by clicking the Patreon button below.","link":"/donate/index.html"},{"title":"","text":"--- title: tags date: 2020-04-18 03:51:32 type: &quot;tags&quot; ---","link":"/tags/index.html"},{"title":"Tools","text":"Ninjutsu OS for Pentesting/Red Teaming Tools kitExpect updates here to any progress we may be making. Contributions are welcome. Red TeamingInformation Gathering (Red Teaming)(100/Tools) ADACLScanner R3con1z3r-Web information gathering ADExplorer Recon-Dog ADOffline Recon-ng ADRecon Reconspider-Advanced (OSINT) AdFind-Command line Active Directory query Red Rabbit Amass RedRabbit-Red Team PowerShell Script Aquatone ScrapedIn- LinkedIn Scraper Asset Finder Searchsploit Atscan SharpHound BaseQuery- Organize public combo-lists &amp; data breaches SharpHound BeRoot SharpView Bettercap Sherlock-Find usernames across social networks BloodHound ShodanSploit Bloodhound-Custom-Queries SpiderFoot BridgeKeeper-Scrape employee names SpoolerScanner Censys Subdomain Finder Sub Finder CloudBunny-Find the real IP behind WAF SubOver-Subdomain Takeover Tool Cloud_Enum-Multi-cloud OSINT Sublist3r CrossLinked- LinkedIn enumeration tool Sudomy-Powerful Subdomain Enumeration Dirble- WebSite Directory Scanning Turbolist3r Dump Users URLCrazy Watson Email extractor WhatBreach-OSINT tool to find breached Email-verify WhatWAF EmailHarvester WhatWeb EyeWitness WhatsMyName- User Enumeration FOCA v3.4.6.2 WinScanX GUI Fierce WinScanX-CL Findomain Windows Exploit Suggester Get-ReconInfo XCTR-Hacking-Tools GoBuster browseList Gowitness-Web screenshot utility ffuf - Fuzz Faster Hunter h8mail- Email OSINT and breach hunting InSpy - LinkedIn enumeration identYwaf Lazagne- Credentials recovery mimikatz LinkedIn Recon Tool -LinkedInt nbtscan LittleBrother-Information gathering (OSINT) nmap MSOLSpray - A Password Spraying Tool pockint Maltego recon-ng - Web Mass-Maillist-Cleaner srvinfo NetRipper subDomainsBrute Nirsoft Launcher subdomain-bruteforce Nmap - Zenmap GUI subjack-Subdomain Takeover tool OneForAll - Subdomain Scanner theHarvester Photon-fast crawler designed for OSINT wafw00f PowerView wePWNise PowerView_dev winfo Prowl - Email harvesting tool zenmap Active Directory Tools (Red Teaming)(199/Tools): Administration Tools sqlcmd Sysinternals Evasion (Red Teaming)(22/Tools): AVIATOR_x64 PSAttack AVIator- Antivirus Evasion Project PowerLessShell CheckPlease PowerShdll DefenderCheck PowerShell Armoury-Evading anti-virus DotNetToJScript StarFighters Invoke-CradleCrafter SysWhispers-AV-EDR evasion Invoke-DOSfuscation demiguise Invoke-Obfuscation nps Invoke-Phant0m pafishmacro Macro Pack-Automatize Obfuscation &amp; Generation of MS Office tvasion - Anti virus evasion PSAmsi xencrypt-Anti-virus evasion Tool Exploitation (Red Teaming) (64/Tools): ADAPE PowerShell-Suite API Monitor x64 PowerSploit API Monitor x86 PowerUpSQL BetterBackdoor-create &amp; Control a backdoor PowerZure- Assessing Azure security CVE-2019-1040-Scanner PrivExchange Chisel - Fast TCP tunnel over HTTP PrivescCheck Win -Privilege Escalation Enumeration CrackMapExecWin Privilege-Escalation-Awesome-Scripts-Suite CredsLeaker-credentials stealer ROADtools - Azure AD Exploration Framework DAMP ROADtools-GUI - Azure AD Exploration Framework Dumpert RedTeam CSharp Scripts Evil-Winrm-Ultimate WinRM shell for pentesting RedTeam Powershell Scripts EvilClippy Red_Team - Useful Scripts EvilURL- Generate unicode domains ReverseTCPShell- PowerShell ReverseTCP Shell Eviloffice RottenPotatoNG Exchange-AD-Privesc Sharp-Suite GadgetToJScript SharpClipHistory Generate-Macro SharpExchangePriv GhostPack SharpExec Invoke-ACLPwn SharpSploit Invoke-DCOM Shellerator-bind-reverse shell Generater Invoke-GoFetch SpoolSample Invoke-PSImage UACME Invoke-PowerThIEf impacket-examples-windows Jalesc-Linux Privileges Escalating juicy-potato Meterpeter-C2 Powershell Command &amp; Control Framework kali-windows-binaries MicroBurst - PowerShell Toolkit for Attacking Azure lsassy-Extract credentials from lsass remotely NetshHelperBeacon luckystrike Orca metatwin PSReflect nishang PowerLurk ruler PowerPriv vssown PowerSharpPack-Usefull offensive CSharp Projects vulcan Password Attacks (Red Teaming) (18/Tools): ADFSpray - MS Password Spray Attack Get-LAPSPasswords LAPSToolkit ASREPRoast Internal-Monologue MSOLSpray - A Password Spraying Tool Check-LocalAdminHash Inveigh MailSniper CredNinja Invoke-TheHash RiskySPN DSInternals KeeFarce SessionGopher DomainPasswordSpray KeeThief mimikittenz Vulnerability Analysis (Red Teaming) (6/Tools): AD Control Paths Grouper2 PowerSharpPack-Usefull offensive CSharp Projects Egress-Assess NtdsAudit zBang Information Gathering (119/Tools): AWSBucketDump AdFind-Command line Active Directory query Amass Aquatone Asset Finder Atscan BaseQuery- Organize public combo-lists &amp; data breaches Bettercap BridgeKeeper-Scrape employee names Bucket-Stream-Find Amazon S3 Bucket Cansina - Web Content Discovery Censys Subdomain Finder CloudBunny-Find the real IP behind WAF Cloud_Enum-Multi-cloud OSINT Cloudfail Cloudmare CrossLinked- LinkedIn enumeration tool DNS Recon DirBuster Dirble- WebSite Directory Scanning Dirsearch- Web path scanner Droopescan Dump Users ESmai Email extractor Email-verify EmailHarvester Essential NetTools EyeWitness FOCA v3462 Fierce FinalRecon- All-In-One Web Reconnaissance Findomain Fprobe-Scan Domains Subdomains for http-https Git-Hound Git-Leak GitHack-Git folder disclosure exploit GitMiner-Advanced mining for content Github Github-Dork Gitrob Gobuster Goby - Attack surface mapping Gowitness-Web screenshot Utility Hunter InSpy - LinkedIn enumeration IoTSeeker Kicks3-S3 bucket finder Lazagne- Credentials recovery LinkedIn Recon Tool -LinkedInt LittleBrother-Information gathering (OSINT) Leetlinked - Scraping tool for LinkedIn Maltego Mass-Maillist-Cleaner Masscan Nirsoft Launcher Nmap - Zenmap GUI OneForAll - Subdomain Scanner Pacu - AWS exploitation framework Pathbrute-Directory Discovery Tool Photon-fast crawler designed for OSINT Prowl - Email harvesting tool R3con1z3r-Web information gathering Recon-Dog Recon-ng Reconspider-Advanced (OSINT) RastLeak - Find leak information Recurse Buster RedRabbit-Red Team PowerShell Script S3Scanner- Scan s3 buckets for security issues SSL-Scan ScrapedIn- LinkedIn Scraper Searchsploit Sherlock-Find usernames across social networks ShodanSploit Shuffledns- Enumerate valid subdomains Slurp- Enumerates S3 buckets Snoop - Nickname Search Tools OSINT Spaghetti SpiderFoot Sub Finder SubOver-Subdomain Takeover Tool Sublist3r Sudomy-Powerful Subdomain Enumeration Turbolist3r URLCrazy WhatBreach-OSINT tool to find breached WhatWAF WhatWeb WhatsMyName- User Enumeration WinScanX GUI WinScanX-CL Windows Exploit Suggester XCTR-Hacking-Tools browseList ffuf - Fuzz Faster gau (GetAllURLs) git Graber h8mail- Email OSINT and breach hunting hakrevdns - Reverse DNS lookups hping httprecon httprobe - Scan Domains Subdomains for http-https identYwaf inSp3ctor-AWS S3 Bucket Finder mimikatz nbtscan nc nc64 nmap pockint recon-ng - Web s3recon-Amazon S3 bucket finder and crawler shhgit-Find GitHub secrets srvinfo sslyze subDomainsBrute subjack-Subdomain Takeover tool theHarvester trufflehog- Searches through git repositories for secrets wafw00f winfo Web Application Attack (80/Tools): Aquatone SQLi-Hunter-SQLMAP API wrapper Arjun SQLmap Atlas- Quick SQLMap Tamper Suggester SSL-Scan Atlas-Quick SQLMap Tamper Suggester SSRFmap-SSRF Scanner Atscan See-SURF- find potential SSRF parameters BSQLGUI Shuriken-XSS BruteXMLRPC SleuthQL BruteXSS SoapUI 5.5.0 BurpSuite Free Edition Spaghetti CMSeeK- CMS Detection and Exploitation suite TestSSL.sh Cansina - Web Content Discovery VBscan - vBulletin Vulnerability Scanner Commix - Command injection exploit Vega - Web vulnerability scanner Corsy-CORS Misconfiguration Scanner WAScan - Web Application Scanner DSSS-sql-injection WPScan-WordPress Vulnerability Scanner Dalfox - XSS Scanning Wapiti-Web Vulnerability Scanner WebCruiser Scanner DirBuster Weblogic-Scanner Dirble- WebSite Directory Scanning WhatWAF - advanced firewall detection tool Dirsearch- Web path scanner WhatWeb Droopescan Wordpress Exploit Framework ExploitMyUnion XBruteForcer (CMS) Eyewitness XMLrpc-bruteforcer Findom-XSS XSS-Freak Fuxploider-File upload scanner and exploitation XSS-Loader Tools Golismero XSSfork - XSS Vulnerability Scan Gowitness-Web screenshot utility XSSpwn IIS-ShortName-Scanner XSSsniper IIS-Shortname-Scan (Python) XSStrike Joomscan XSpear-XSS Scanning Link JS Find - Extract URL Websites bWAPP- vulnerable web-application LinkFinder dotdotpwn - Directory Traversal Fuzzer Nikto ffuf - Fuzz Faster NoSQLMap httprecon Nuclei - Web Scanner based on templates identYwaf OWASP Mutillidae- Vulnerable web-application jsql-injection-GUI OWASP ZAP Proxy jwtcat - Cracking JSON Web Token Quick-SQL pentest-tools R3con1z3r-Web information gathering sslyze Recurse Buster wafw00f SPartan-Sharepoint wfuzz SQLMap-GUI Wireless Attacks (36/Tools): Airbase-ng Airserv-ng Easside-ng Tkiptun-ng Wpaclean Aircrack-ng-GUI Airtun-ng Evil FOCA WNetWatcher ettercapNG Aircrack-ng Airventriloquist-ng Jumpstart Waircut ivstools Airdecap-ng Besside-ng Kstats Wesside-ng wifi-perfiles Airdecloak-ng Bettercap Makeivs-ng WifiChannelMonitor Aireplay-ng Buddy-ng Packetforge-ng WifiInfoView Airodump-ng Cain and abel RouterScan WirelessNetView Airolib-ng Dumpper SSL-Strip Wireshark Exploitation Tools (35/Tools): BSQLGUI Shellerator-bind-reverse shell Generater CVE-2019-1040-Scanner Shuriken-XSS Chisel - Fast TCP tunnel over HTTP VBscan DSSS-sql-injection WebCruiser Scanner EvilURL- Generate unicode domains WinScanX GUI Eviloffice Windows Exploit Suggester ExploitMyUnion XSS-Loader Tools Goby - Attack surface mapping XSSpwn Jalesc-Linux Privileges Escalating XSSsniper Metasploit XSStrike MicroBurst - PowerShell Toolkit for Attacking Azure hjsplit Nikto jsql-injection-GUI NoSQLMap mimikatz PowerZure- Assessing Azure security nc Privilege-Escalation-Awesome-Scripts-Suite nc64 ROADtools - Azure AD Exploration Framework subdomain-bruteforcer(SubBrute) ROADtools-GUI - Azure AD Exploration Framework wePWNise SQLmap Vulnerability Analysis (33/Tools): BSQLGUI SQLmap Weblogic-Scanner DSSS-sql-injection SSH Scan WinScanX GUI Droopescan SSL-Scan WinScanX-CL ExploitMyUnion Searchsploit XSS-Freak Golismero Shuriken-XSS XSS-Loader Tools Joomscan SleuthQL XSSpwn Nikto Spaghetti XSSsniper NoSQLMap TestSSL.sh XSStrike OWASP Mutillidae- Vulnerable web-application VBscan XSpear-XSS Scanning OWASP ZAP Proxy WAScan bWAPP- vulnerable web-application SMBGhost-CVE-2020-0796 WebCruiser Scanner jsql-injection-GUI Malware analysis (45/Tools): Autoruns LockHunter Task Explorer x64 exeinfope Binwalk Microsoft Sysinternals Task Explorer exiftool Comodo Cleaning Essentials PE Detective UPXEasyGUI loki-upgrader CrowdInspect PPEE UniExtract loki CrowdInspect64 Process Hacker 2 VirusTotal Uploader 22 ollydbg Detect It Easy ProcessActivityView Volatility-CL pdbripper FLOSS ProcessHacker VolatilityWorkbench-gui pestudio FolderChangesView Registry Changes View Winja (VirusTotal Uploader) peview HijackCleaner64 Regshot-x64-ANSI Wireshark windump ILProtectorUnpacker Regshot-x64-Unicode apateDNS IREC-1916 RunPEDetector32 dnSpy-x86 KillSwitch Sandboxed Web Browser dnSpy Mobile Security Tools (26/Tools): APK Easy Tool Drozer GDA-android-reversing-Tool dex2smali APK Editor Studio Frida-discover Mobile Security Framework (MobSF) frida-objection Android Debug Bridge (adb) Frida-kill Multi-Drive frida-pygmentize Apkid Frida-ls-devices Nox jadx-gui Apktool Frida-ps OWASP ZAP Proxy vulnerable apk Bytecode-Viewer Frida-trace appmon DB Browser for SQLite Frida dex2jar Network Attack (32/Tools): Bettercap FindSQLSrv-Python Responder-Python WinScanX GUI BeyondTrustDiscoveryTool Goby - Attack surface mapping Responde Wireshark BrowserListener-Python Icmp-Redirect-Python RouterScan ettercapNG Cain Jumpstart RunFinger-Python nc Dumpper MultiRelay-Python SSH Scan nc64 Essential NetTools MultiRela SSL-Strip odict-Python Evil FOCA NetworkMiner SnmpWalk snmptest FindSMB2UPTime-python Nirsoft Launcher Waircut sslyze Password Attacks (48/Tools): Get-LAPSPasswords LAPSToolkit ASREPRoast Internal-Monologue Check-LocalAdminHash Inveigh MailSniper CredNinja Invoke-TheHash RiskySPN DSInternals KeeFarce SessionGopher DomainPasswordSpray KeeThief mimikittenz ADFSpray - MS Password Spray Attack MSOLSpray - A Password Spraying Tool BruteXMLRPC Md5Cracker Bruter Password Recovery Cain Patator - Brute-force CeWL-Creating Custom Wordlists Smtp-Cracker Crunch WinScanX GUI Fast-RDP-Bruteforce WinScanX-CL Go-jwt-cracker XBruteForcer (CMS) Hash-Buster- Online Crack hashes XMLrpc-bruteforcer Hash-identifier cap2hccap Hashcat CLI cap2hccapx Hashcat GUI jwtcat - Cracking JSON Web Token IMAP Bruteforce pydictor-dictionary builder for brute-force John the Ripper rainbowcrack-cl John the Ripper GUI rcrack-gui Kraken-Password crack RAR ZIP 7z thc-hydra-BruteForce Password Recovery (17/Tools): BulletsPassView OperaPassView RouterPassView WebBrowserPassView mailpv pspv ChromePass PasswordFox SniffPass WirelessKeyView mspass rdpv Dialupass PstPassword VNCPassView iepv netpass Wordlists : Payload-List PayloadsAllTheThings Probable-Wordlists RobotsDisallowed SecLists fuzzdb Reverse Engineering (13/Tools): APK Easy Tool Bytecode-Viewer de4dot-net35 dnSpy-x86 ollydbg Apktool ResourceHacker de4dot-net45-x64 dnSpy Binwalk de4dot-net35-x64 de4dot-net45 jadx-gui Stress Testing (13/Tools): DDos-Attack (Python) Saddam-DDoS Amplification Tool WhatWAF DDos-Attackv1 (Python) Slowloris HTTP DoS IPv6 identYwaf HostDown- DDos Attack Slowloris HTTP DoS wafw00f Impulse Denial-of-service ToolKit THC-SSL-Dos Perl Flood Script (DDoS) TheDoomsday- Test DOS sustainablity Proxy and Privacy Tools (8/Tools): Epic Privacy Browser Proxy-Scraper Simple DnsCrypt W10Privacy OOSU10 ProxyCap Tor Browser WPD Others bWAPP, a buggy web application! OWASP Mutillidae OSINT Websites Cheat Sheets Repositories Remote Control Tools (13/Tools): AnyDesk OpenVPN GUI nc pageant pscp putty telnet HeidiSQL TeamViewer nc64 plink psftp puttygen Utility Tools (57/Tools): 7-Zip File Manager HeidiSQL Search Everything AnyDesk HostsFileEditor Simple DnsCrypt AutoIt3 HxD SumatraPDF Boxstarter Shell KeepNote Task Explorer x64 CFF Explorer KeepPass Task Explorer Chrome -with XSS Auditor disabled MarkdownEdit TeamViewer Chrome MobaXterm Tor Browser CyberChef Mysql Wireshark DB Browser for SQLite Neo4j_start.bat cmder Email extractor Neo4j_stop.bat hjsplit Email-verify NetworkMiner neo4j-community Epic Privacy Browser Nirsoft Launcher ngrok- reverse proxy Essential NetTools OpenVPN GUI notepad++ FLOSS PE Detective peview Fiddler PHP qBittorrent FileZilla Server Interface ProcessHacker services Firefox Rainmeter shellcode_launcher Greenshot RunAsDate vlc HTTP File Server (HFS) ScreenToGif xampp-control","link":"/Tools/index.html"},{"title":"docs","text":"Documentation (Updated 17/05/2020) An important part of any operating system is documentation, the technical manuals which describe the operation and use of programs. As part of its efforts to create a high-quality operating system, the Ninjutsu Project is making every effort to provide all of its users with proper documentation in an easily accessible form. The documentation is a continuous work in progress, and all Ninjutsu users are invited to contribute to the creation and translation process of this portal. What is Ninjutsu Project? Ninjutsu is Penetration testing/Red Teaming distribution based on Windows focused on Penetration Testing, Red Teaming,Security Auditing , Malware analysis and Android Penetration Testing. It includes a full portable arsenal for security experts, but it also includes pre-configured and installed Android Pentesting Integrated Environmental, In addition, protect your privacy by tweak and customize Windows 10, disable the collection services/Apps to improving your anonymity/performance. Ninjutsu contains more than 800 tools that are geared towards various information security tasks, such as Penetration Testing, Red Teaming, Malware analysis, Android Penetration Testing, and Reverse Engineering. Ninjutsu is created and customize by Hasan Al-Qawzai (Information security expert) . Ninjutsu Project was released on the 08th May, 2020. Features Windows 10 Pre-Installed Penetration Testing, Red Teaming, and Android Security Testing Integrated Environment. More than 800 penetration testing tools. Free and Open source Tools. Prefills the commandline. Terminal with many useful features. Customize Windows 10 with powerful tweak and optimize. Protect your privacy by tweak and customize Windows 10. Disable many of the annoying features built into windows. Unwanted Windows components removal. Remove/Disable many Windows programs and services. Downloading Ninjutsu Project IMPORTANT! Never download Ninjutsu Project from anywhere other than the official sources. Always be sure to verify the MD5/SHA256 checksums of the file you’ve downloaded against our official values. It would be easy for a malicious entity to modify a Ninjutsu Project installation to contain exploits or malware and host it unofficially. Where to Get Official Ninjutsu Project Offlne installtion The Ninjutsu Project are available both as directly downloadable .exe files or via .torrent files. Verifying Your Downloaded Ninjutsu Image ##Why do I need to do this? Before you run Ninjutsu Project , or install it to your hard disk, you want to be very sure that what you’ve got actually is Ninjutsu Project, and not an imposter. Ninjutsu is a professional penetration testing and red teaming toolkit. As a professional penetration tester, having absolute confidence in the integrity of your tools is critical: if your tools aren’t trustworthy, your investigations won’t be trustworthy, either. Windows12Ex : CertUtil -hashfile &lt;File Nme&gt; MD5 CertUtil -hashfile Ninjutsu-v1.0.exe MD5 Useing third-party tools :1- Download the Checksum Calculator http://www.checksumcalculator.com/ 2- Run the executable, checksumcalculator_setup.exe. 3- Follow the prompts to install the program. 4- Open the Checksum Calculator Click the Browse next to the file box and browse to the file you want to check. Select “Ninjutsu-v1.0.exe” file. 5- Select the type of Checksum you are calculating, By default, the Checksum is set to MD5 6- Click the Calculate button. Linux123md5sum Ninjutsu-v1.0.exesha256sum Ninjutsu-v1.0.exe MacOS123md5 Ninjutsu-v1.0.exeshasum -a 256 Ninjutsu-v1.0.exe User Guide Getting StartedMinimum System Requirements : CPU : Intel/AMD Dual core Processor RAM : 2 GB of RAM DDR3/DDR4 Storage : 60 GB of Hard drive space Installing Ninjutsu as Main OS in Your Computer/Laptop :To install Ninjutsu OS on your computer or laptop you need : Verify your partition scheme USB flash 32 GB Ninjutsu OS ISO Storage : 60 GB of Hard drive space (Minimum) (Ninjutsu OS will take 53 GB from total storage available) Rufus software (Download from https://rufus.ie ) Before you start to format your machine check your disk partition scheme IMPORTANT! Don’t forget your laptop it’s include your original windows installation, it’s called recovery mode or windows reset factory , so don’t do this tutorial if you don’t want lose ur recovery windows, I recommend you use PartitionMagic to check ur disk before starting format You can view this information in the DIsk Management tool incldued with Windows. To access it, right-click the Start menu or press Windows Key+X and select “Disk Management.” You can also press Windows Key+R to open the Run dialog, type “diskmgmt.msc” into the box, and press Enter. Select Disk Management Locate the disk you want to check in the Disk Management window. Right-click it and select “Properties.” Click over to the “Volumes” tab. To the right of “Partition style,” you’ll see either “Master Boot Record (MBR)” or “GUID Partition Table (GPT),” depending on which the disk is using. Download software Rufus and plugin ur USB FLASH Open Software Rufus In our example we are going to create a bootable USB stick “GPT” containing the Ninjutsu OS , Don’t be a blindly follow the lesson, maybe your laptop/computer is MBR , so be careful Now we finished create bootable USB stick , After that restart your computer and boot from USB. Use internet resource to find How to Boot from USB on Windows warning Now be careful I don’t want you format wrong drive and lose your data Press shift + F10 to open cmd prompt Then type the following command: 123DiskpartList volDir d:\\ The installation finished congratulations After installation maybe you will getting random slowdown to your windows 10, so I recommend you to update drivers, you can use Driver Booster 7 to update and tweak your laptop Download :https://www.iobit.com/en/driver-booster.php Dual boot Windows 10,8,7 with Ninjutsu OSwe are going to explain everything in detail how to install Ninjutsu OS as second boot with your main windows 10,8,7 Minimum Requirements :1- Ninjutsu OS Image 2- Empty drive partition in your machine with 55 GB (Minimum) (Ninjutsu OS will take 53 GB from total storage available) in our example , I’m going to install Ninjutsu OS on drive partition E:you only need to define where you want to install other operating system (Ninjutsu OS) in your Laptop/Computer You can view this information in the DIsk Management tool incldued with Windows. To access it, right-click the Start menu or press Windows Key+X and select “Disk Management.” You can also press Windows Key+R to open the Run dialog, type “diskmgmt.msc” into the box, and press Enter. if you don’t have empty drive partition to install Ninjutsu OS , you have to create drive partition and format it , in my tutorial drive partition windows 10 Step 1: Right-click one hard disk partition and select “Shrink Volume”. Step 2: Enter the amount of space you want to shrink in MB as shown below then click on the “Shrink” button. Step 3: Right-click on the unallocated space and select “New Simple Volume”. Step 5: You’ll now enter the New Simple Volume Wizard interface by clicking “Next” and specify a volume size. Step 6: Assign Drive Letter or Path, then format the partition into the default file system NTFS. Click “Finish” to complete creating a new partition in Windows 10. We are going to explain how to install and use two windows edtion in the same computer/laptop : 123C:\\ ------------&gt; Windows 10 , 8 or 7E:\\ ------------&gt; Ninjutsu OSD:\\ ------------&gt; Ninjutsu OS Image To install Ninjutsu os type the following command: 1dism /Apply-Image /ImageFile:D:\\Sources\\install.wim /Index:1 /ApplyDir:E:\\ now wait until Ninjutso OS deploy in your drive E Next step , add deployed Windows on drive E: to Windows boot menu, use following command: 1bcdboot E:\\Windows Now write this command to check defult profile and currnet profile windows BCDEdit is a command-line tool for managing Boot Configuration Data (BCD). BCD files provide a store that is used to describe boot applications and boot application settings. BCDEdit can be used for a variety of purposes, including creating new stores, modifying existing stores, adding boot menu options, and so on. You’ll need administrative privileges to use BCDEdit to modify BCD open your cmd as administrator 1bcdedit Boot Options Identifiers : 123{default} device partion E: (Ninjutso OS){current} device partion C: (your current system ) Now we need to change the boot description , When deployed, the new OS has ID {default}. To rename it, give it a better description, use following command: 12bcdedit /set {default} description &quot;Ninjutsu OS&quot;bcdedit /set {current} description Windows 10 Pro&quot; How To Install Ninjutsu OS in VMware Workstation : How To Install Ninjutsu OS in Oracle VM VirtualBox : Improve your privacy setup Simple dnscrypt + VPN : what is the information may be disclosed to government/ISP provider when you browsing Internet? And what’s the solution! In the normal use of the Internet, the information you need to take care of: MAC address DNS requests Site or service address even in TLS connection The IP address of the site or service Unencrypted information MAC address : This Mac address can track your positions.It is best to have a different MAC address each time you connect to the Internet. You can use a variety of tools, but in Windows 10, you can enable it: Turn On or Off Random Hardware MAC Addresses for Wi-Fi in Windows 10 another way to change your MAC address by use software such as MAC Address Scanner 5.0 https://www.majorgeeks.com/files/details/mac_address_scanner.html MacMakeup 2.2.3.5 https://www.majorgeeks.com/files/details/mac_makeup.html 2- DNS requests Normally, even if you use 1.1.1.1, your DNS requests can be easily heard. Only if you use DNSCrypt or other encrypted items, your DNS requests will not be heard. You can use SimpleDNScrypt , follow up to the pictures shown below 3- Site or service address even in TLS connection : The addresses of the sites you visit will be transmitted in plain text via SNI, which is audible. You can only use a proxy or a valid VPN to solve this problem. 4- IP address of the site or service: Many sites have dedicated servers. Donating an IP address is equal to donating a site address. As before, you can only use a proxy or a valid VPN to solve this problem. 5- Unencrypted information : Unencrypted information needs no explanation and you should use a VPN. But there is still a big problem! What happens if you accidentally and unintentionally disconnect your VPN?Some of your sensitive information will be disclosed! To prevent this from happening, your VPN must have Kill-Switch functionality follow up to the pictures shown below Installing Docker for Windows and install Kali lunix :One of the big problems when doing pentesting or security tests is having all the tools. Docker helps you to have environments where we can have different tools without having to fight with different libraries or dependencies that need certain tools. Now Using Docker to run Cyber Security Tools is becoming more and more popular. To use docker in your computer you have to : Enable Hyper-V , The Ninjutsu OS has been enabled “Hyper-V” by default. Enable Intel VT-X/AMD Virtualization on VMware/VirtualBox and PC You should be aware that Docker requires VT-X/AMD-v virtual hardware extension to be enabled before you can run any container. Depending on your computer, you may need to reboot and enable it in your BIOS. You can check if VT-X/AMD-v is enabled by running systeminfo from the command prompt. 1systeminfo 1. Enable Hyper-V on Windows 10 2. Enable Intel VT-x or AMD virtualizationTo enable Intel VT-X &amp; AMD virtualization, open VMware and select the virtual machine you want to enable Intel/AMd virtualization for, then click on Edit virtual machine settings. Now select the Processors option and you’ll see the Intel VT-X &amp; AMD Virtualization enabling option beside and mark it if you want. Also, you can let the virtualization engine by default(Automatic), the automatic option uses the three options there when required and disable them when they aren’t needed. Enable Intel VT-x/AMD Virtualization on VirtualBox Here, select the System tab and select Acceleration tab then you can see and enable Intel VT-x or AMD virtualization and click Ok. Enable Intel VT-x/AMD Virtualization on your computer/Laptop Please follow the motherboard/Laptop guide to enable Intel VT-x/AMD Virtualization from Bios So now after enable Intel VT-x or AMD virtualization in your Vmware/VirtualBox and PC Installing DockerYou can download Docker for Windows with: 1choco install docker-desktop You should restart your laptop after you install Docker. Now how do you know if Docker is working?Open a new command prompt and type: 1docker ps If everything works as expected, you should see an empty list of containers running. Install Kali Linux from DockerWe all already know kali Linux and it has a great variety of tools that are useful to carry out different tasks, but we also have a docker to use kali. Setting up a Kali Linux Docker Image : 12docker pull kalilinux/kali-rollingdocker run -t -i kalilinux/kali-rolling /bin/bash Now I’m going to install Metasploit , nmap and sqlmap on Kali Linux image 1apt-get update &amp;&amp; apt-get install metasploit-framework nmap sqlmap How to Remove Docker Containers Kali Lunix from your PC : You can get a list of all containers by passing the -a flag to the docker container ls command: 1docker container ls -a The output should look something like this: 123C:\\Users\\Administrator\\Desktop&gt;docker container ls -aCONTAINER ID IMAGE COMMAND CREATED STATUS PORTS NAMES2e89361f5005 kalilinux/kali-rolling &quot;/bin/bash&quot; 54 minutes ago Exited (130) 1 second ago vibrant_meitner Once you know the CONTAINER ID of the containers you want to delete, pass it to the docker container rm command. For example, to remove the first two containers listed in the output above run: 1docker container rm 2e89361f5005 Other method and example how to remove docker image : 1234567# docker ps -adocker ps -a CONTAINER ID IMAGE COMMAND CREATED STATUS PORTS NAMESd1c01c8eb336 ubuntu:14.04 &quot;/bin/bash&quot; 5 seconds ago Exited (0) 3 seconds ago ubuntudf7834f86c78 debian:stable &quot;/bin/bash&quot; 10 seconds ago Up 9 seconds debian 9bdd9d49a75b mongo:3 &quot;/entrypoint.sh mong 18 minutes ago Up 18 minutes 27017/tcp mongodb 774b02c9c51a oraclelinux:7 &quot;/bin/bash&quot; 27 minutes ago Up 27 minutes oracle7 123docker rm --force debiandocker rm --force mongodbdocker rm --force ubuntu To check the size of docker images : 12345678C:\\Users\\Administrator\\Desktop&gt;docker image lsREPOSITORY TAG IMAGE ID CREATED SIZEctfd/ctfd latest ba8fec4b9a20 2 days ago 500MBctfwiki/ctf-wiki latest a4ad75128371 5 days ago 195MBkalilinux/kali-rolling latest d88b418fb1f9 6 days ago 114MBparrotsec/security latest 35cfd692bb97 2 weeks ago 4.71GBpyaillet/ctf-tools latest f57c8c381e52 6 months ago 992MBsimplysecurity/simplyemail latest 58c90bda30f4 2 years ago 684MB Install Parrot on Ninjutsu OS :Here the Repositories of Parrot https://hub.docker.com/u/parrotsec you can install different tools without having to fight with different libraries or dependencies 12docker pull parrotsec/securitydocker run -ti --network host parrotsec/security Install single tools SimplyEmail on Ninjutsu OS :12345678910111213141516171819202122docker pull simplysecurity/simplyemaildocker run -ti simplysecurity/simplyemail -hdocker run -ti simplysecurity/SimplyEmail.py -all -e cybersyndicates.comor in verbosedocker run -ti simplysecurity/SimplyEmail.py -all -v -e cybersyndicates.comor in verbose and no &quot;Scope&quot;docker run -ti simplysecurity/SimplyEmail.py -all -v -e cybersyndicates.com -sor with email verificationdocker run -ti simplysecurity/SimplyEmail.py -all -v -verify -e cybersyndicates.com or with email verification &amp; Name Creationdocker run -ti simplysecurity/SimplyEmail.py -all -v -verify -n -e cybersyndicates.com or json automationdocker run -ti simplysecurity/SimplyEmail.py -all -e cybersyndicates.com --json cs-json.txt Install CTF TOOLS on :12docker pull zardus/ctf-toolsdocker run -ti zardus/ctf-tools Other Useful Docker Images : https://hub.docker.com/r/aaaguirrep/pentest Kali Linux12docker pull kalilinux/kali-rollingdocker run -t -i kalilinux/kali-rolling /bin/bash Parrot12docker pull parrotsec/parrot-coredocker run -t -i parrotsec/parrot-core /bin/bash Metasploit framework12docker pull remnux/metasploitdocker run -t -i remnux/metasploit /bin/bash Sqlmap12docker pull paoloo/sqlmapdocker run -it paoloo/sqlmap --url http://localhost W3AF vulnerability scanner12docker pull andresriancho/w3afdocker run -t -i kalilinux/kali-rolling /bin/bash Amass12docker build -t amass https://github.com/OWASP/Amass.gitdocker run -v OUTPUT_DIR_PATH:/.config/amass/ amass enum --list sherlock123docker build -t mysherlock-image .docker run --rm -t mysherlock-image user123docker run --rm -t -v &quot;$PWD/results:/opt/sherlock/results&quot; mysherlock-image -o /opt/sherlock/results/text.txt user123 Docker Notes List Docker CLI commands12dockerdocker container --help Display Docker version and info123docker --versiondocker versiondocker info Searching a Docker Image123docker search [search term]docker search pentestdocker search centos Build Docker image from Dockerfile123456docker build -t &lt;image name&gt;:&lt;tag&gt; &lt;file path of Dockerfile&gt;Options:-t option to specify tag or name of the image (If tag is not specified, the default value of 'latest' will be used)Ex : docker build -t nginx . Execute Docker image1docker run hello-world List Docker images123456docker imagesdocker image lsOptions:--quiet option to only show the image ID--filter option to filter out images based on certain conditions (ie --filter=dangling=true) 123456docker ps -a # Lists containers (and tells you which images they are spun from)docker rm &lt;container_id&gt; # Removes a containerdocker rmi &lt;image_id&gt; # Removes an image docker rmi -f &lt;image_id&gt; # Forces removal of image even if it is referenced in multiple repositories, # i.e. same image id given multiple names/tags # Will still fail if there is a docker container referencing image List Docker containers (running, all, all in quiet mode)123docker container lsdocker container ls --alldocker container ls -aq Remove Docker images1docker rmi {image-id || image-name} Remove Docker containers1docker rm {container-id} (no need to enter all id)","link":"/docs/index.html"},{"title":"Guide","text":"Linux Commandagrepbzip2catchgrpcksumdiffdiff3duechoexpandexprfindgrepgunzipgziplesspwdsedshartailtartrtouchtypeunameunrarunsharunzipuudecodeuuencodewcwgetwhichwhoamiwhoisxargszcathostdigawkbasenamebashbcbisonbunzip2bzip2recoverchmodchownchrootcpcsplitdcdddfdirnamedos2unixclsexitegrepenvfactorfgrepflexfmtfoldgawkgfindgsargsortheadhostidhostnameidindentinstalljoinjwhoislesskeylnlsm4makemd5summkdirmkfifomknodmvnanoncnc64ncftpnewfoxnlodpageantpastepatchpathchkprprintenvprintfpscppsftppsgputtyputtygenrmrmdirscpsdiffseqsftpsha1sumsleepsshsusumsynctactacteeunix2dosunlinkvimzipi686-w64-mingw32-addr2linei686-w64-mingw32-gcovi686-w64-mingw32-ari686-w64-mingw32-gprofi686-w64-mingw32-asi686-w64-mingw32-ldi686-w64-mingw32-c++i686-w64-mingw32-ld.bfdi686-w64-mingw32-c++filti686-w64-mingw32-nmi686-w64-mingw32-cppi686-w64-mingw32-objcopyi686-w64-mingw32-dlltooli686-w64-mingw32-objdumpi686-w64-mingw32-dllwrapi686-w64-mingw32-pkg-configi686-w64-mingw32-elfediti686-w64-mingw32-ranlibi686-w64-mingw32-g++i686-w64-mingw32-readelfi686-w64-mingw32-gcci686-w64-mingw32-sizei686-w64-mingw32-gcc-4.9.3i686-w64-mingw32-stringsi686-w64-mingw32-gcc-ari686-w64-mingw32-stripi686-w64-mingw32-gcc-nmi686-w64-mingw32-windmci686-w64-mingw32-gcc-ranlibi686-w64-mingw32-windres Alias NinjutsuA shell alias is a shortcut to reference a command. It can be used to avoid typing long commands or as a means to correct incorrect input. To change Alias in Ninjutsu OS , open command prompt type C:\\Users\\ninjutsu&gt;alias Find below the list of aliases avalible on Ninjutsu OS CLI App Name adb Android Debug Bridge (adb) aircrack-ng aircrack-ng amass The OWASP Amass Project apk-easy APK Easy Tool apktool apktool aquatone aquatone arjun Arjun atscan ATSCAN wpbrutexmlrpc BruteXMLRPC xmlrpcbruteforce xmlrpc-bruteforcer cloudfail CloudFail cloudmare Cloudmare commix commix cain and able cain and able crunch crunch de4dot de4dot testssl.sh testssl.sh droopescan droopescan DSSS-sql-injection DSSS-sql-injection EvilFoca EvilFoca ExploitMyUnion ExploitMyUnion Fast-RDP-Brute Fast-RDP-Brute fierce fierce gobuster gobuster golismero golismero foca FOCA (Fingerprinting Organizations with Collected Archives) hashcat hashcat hashcat-gui hashcat-gui cap2hccapx cap2hccapx cap2hccap cap2hccap hashid hash-identifier hping hping httprecon httprecon Md5Cracker Md5Cracker inspy inspy johnjohnny-gui John the Ripper password cracker joomscan joomscan jsql jsql-injection knock knock masscan masscan mimikatz mimikatz nc netcat nikto nikto NirSoft NirLauncher NoSQLMap NoSQLMap ollydbg ollydbg OneForAll OneForAll putty putty puttygen puttygen psftp psftp pscp pscp plink plink pageant pageant rcrack-guircrack-cl rainbowcrack recondog ReconDog ResourceHacker ResourceHacker responder responder multirelay responder runfinger responder findSQLSrv responder findSMB2UPTime responder icmp-redirect responder browserlistener responder odict responder responder-bin responder multirelay-bin responder router-scan router-scan runasdate Run-As-Date shodansploit shodansploit shuriken-xss shuriken-xss slowlorisslowloris6 Slowloris HTTP DoS snmptest snmptest ssmpwalk ssmpwalk spaghetti spaghetti spiderfoot spiderfoot sqlmap sqlmap subbrute subbrute sublist3r sublist3r hydra thc-hydra turbolist3r turbolist3r theHarvester theHarvester vbscan vbscan wafw00f wafw00f WhatWaf WhatWaf waflulz WAFlulz identYwaf identYwaf wepwnise wePWNise wfuzz wfuzz SPartan SPartan wes Windows Exploit Suggester (wes) xbruteforcer XBruteForcer xsspwn xsspwn xss-loader XSS-LOADER TOOLS xsssniper xsssniper xsstrike xsstrike searchsploit searchsploit perl-flood Perl Flood Script (DDoS) py-ddos DDos-Attack (python) py-ddos1 DDos-Attack (python) winpwn WinPwn pockint pockint vega vega burp burp suite cmsmap cmsmap findomain findomain sleuthql sleuthql Nessus Nessus essentials DefenseCode WebScanner Community recon-ng recon-ng wascan wascan esmail SimplyEmail email-harvester EmailHarvester exiftool exiftool EyeWitness EyeWitness linkedint LinkedInt r3con1z3r r3con1z3r h8mail h8mail email-extractor email_extractor v1 email-verify email-verify Mass-Maillist-Cleaner Mass-Maillist-Cleaner smbghost SMBGhost weblogic-scanner weblogic-scanner XSS-Freak XSS-Freak jwtcat jwtcat Cracking JSON Web Token winscanx-guiwinscanx WinScanX Basic BSQLGUI (BSQL Hacker) BSQLGUI (BSQL Hacker) WebCruiser 3.5.6 WebCruiser 3.5.6 imap-bruteforce IMAP Bruteforce Script LittleBrother LittleBrother ScrapedIn ScrapedIn BridgeKeeper BridgeKeeper crosslinked crosslinked appmon appmon frida-server frida frida mobsf mobsf drozer drozer objection objection jadx jadx dex2jar dex2jar dex2smali dex2smali apkid APKiD - Android Application Identifier bytecode bytecode-viewer loki loki pestudio pestudio exeinfo exeinfo VolatilityWorkbench VolatilityWorkbench ettercap Ettercap ffuf ffuf - Fuzz Faster U Fool assetfinder assetfinder recursebuster Recurse Buster gowitness gowitness bwapp Bwapp mutillidae OWASP Mutillidae Remote Server Administration Tools (RSAT) Remote Server Administration Tools (RSAT) SQL Server Command Line Utilities SQL Server Command Line Utilities Sysinternals Sysinternals Covenant Covenant WMImplant WMImplant WMIOps WMIOps CheckPlease CheckPlease Demiguise Demiguise DefenderCheck DefenderCheck DotNetToJScript DotNetToJScript Invoke-CradleCrafter Invoke-CradleCrafter Invoke-DOSfuscation Invoke-DOSfuscation Invoke-Obfuscation Invoke-Obfuscation Invoke-Phant0m Invoke-Phant0m Not PowerShell (nps) Not PowerShell (nps) PS&gt;Attack PS&gt;Attack PSAmsi PSAmsi Pafishmacro Pafishmacro PowerLessShell PowerLessShell PowerShdll PowerShdll StarFighters StarFighters SysWhispers SysWhispers ADAPE-Script ADAPE-Script API Monitor API Monitor CrackMapExec CrackMapExec CrackMapExecWin CrackMapExecWin DAMP DAMP Dumpert Dumpert EvilClippy EvilClippy Exchange-AD-Privesc Exchange-AD-Privesc FuzzySec’s PowerShell-Suite FuzzySec’s PowerShell-Suite FuzzySec’s Sharp-Suite FuzzySec’s Sharp-Suite GadgetToJScript GadgetToJScript Generate-Macro Generate-Macro GhostPack GhostPack Rubeus Rubeus SafetyKatz SafetyKatz Seatbelt Seatbelt SharpDPAPI SharpDPAPI SharpDump SharpDump SharpRoast SharpRoast SharpUp SharpUp SharpWMI SharpWMI GoFetch GoFetch Impacket Impacket Invoke-ACLPwn Invoke-ACLPwn Invoke-DCOM Invoke-DCOM Invoke-PSImage Invoke-PSImage Invoke-PowerThIEf Invoke-PowerThIEf Juicy Potato Juicy Potato Kali Binaries for Windows Kali Binaries for Windows LuckyStrike LuckyStrike MetaTwin MetaTwin Metasploit Metasploit Mr. Unikod3r’s RedTeamPowershellScripts Mr. Unikod3r’s RedTeamPowershellScripts NetshHelperBeacon NetshHelperBeacon Nishang Nishang Orca Orca PSBits PSBits PSReflect PSReflect PowerLurk PowerLurk PowerPriv PowerPriv PowerSploit PowerSploit PowerUpSQL PowerUpSQL PrivExchange PrivExchange RottenPotatoNG RottenPotatoNG Ruler Ruler SharpClipHistory SharpClipHistory SharpExchangePriv SharpExchangePriv SharpExec SharpExec SpoolSample SpoolSample SharpSploit SharpSploit ThreadContinue ThreadContinue TikiTorch TikiTorch UACME UACME impacket-examples-windows impacket-examples-windows vssown vssown Vulcan Vulcan ADACLScanner ADACLScanner ADExplorer ADExplorer ADOffline ADOffline ADRecon ADRecon BeRoot BeRoot BloodHound BloodHound BloodHound-Custom-Queries (Hausec) BloodHound-Custom-Queries (Hausec) dnsrecon dnsrecon FOCA FOCA Get-ReconInfo Get-ReconInfo GoBuster GoBuster GoWitness GoWitness Net-GPPPassword Net-GPPPassword NetRipper NetRipper Nmap Nmap PowerView PowerView Dev branch included Dev branch included Privesc (enjoiz) Privesc (enjoiz) Recon-AD Recon-AD SharpHound SharpHound SharpView SharpView SpoolerScanner SpoolerScanner Watson Watson ASREPRoast ASREPRoast CredNinja CredNinja DomainPasswordSpray DomainPasswordSpray DSInternals DSInternals Get-LAPSPasswords Get-LAPSPasswords Hashcat Hashcat Internal-Monologue Internal-Monologue Inveigh Inveigh Invoke-TheHash Invoke-TheHash KeeFarce KeeFarce KeeThief KeeThief LAPSToolkit LAPSToolkit MailSniper MailSniper Mimikatz Mimikatz Mimikittenz Mimikittenz RiskySPN RiskySPN SessionGopher SessionGopher 7zip 7zip AutoIT AutoIT Cmder Cmder CyberChef CyberChef Explorer Suite Explorer Suite Greenshot Greenshot Hashcheck Hashcheck HeidiSQL HeidiSQL HTTP File Server (hfs) HTTP File Server (hfs) HxD HxD Keepass Keepass MobaXterm MobaXterm Neo4j Community Edition Neo4j Community Edition NirLauncher NirLauncher Notepad++ Notepad++ Process Hacker 2 Process Hacker 2 qBittorrent qBittorrent SQLite DB Browser SQLite DB Browser Screentogif Screentogif Shellcode Launcher Shellcode Launcher SimpleDNSCrypt SimpleDNSCrypt Tor Browser Tor Browser VLC Media Player VLC Media Player RedRabbit RedRabbit Docker Docker xspear xspear ssh_scan ssh_scan Terminal Emulator apk Terminal Emulator apk App Analyzer apk App Analyzer apk Androlyzer Privacy Scanner apk Androlyzer Privacy Scanner apk prowl prowl Patator Patator de4dot de4dot cansina cansina DirBuster DirBuster thc-ssl-dos thc-ssl-dos ngrok ngrok Serveo NA Root Checker NetworkMiner Saddam Saddam NetScanTools Pro androbugs AndroBugs Framework androarsc Andro guard androauto Andro guard androlyze Andro guard androaxml Andro guard androcsign Andro guard androdd Andro guard androdiff Andro guard androgui Andro guard androsim Andro guard androwarn Andro guard pidcat Andro guard LaZagne LaZagne hunter hunter Winfo Winfo adfind AdFind sslstrip sslstrip sslyze sslyze sslscan sslscan urlcrazy urlcrazy simple dnscrypt O&amp;O ShutUp10 ProxyCap Proxy-Scraper W10Privacy Epic Privacy Browser FireFox Browser with all plugin web pt Metasploit Armitage bettercap bettercap DNS Recon subfinder subfinder whatweb whatweb Atlas Quick SQLMap Tamper Suggester Cloudflare Cloudflare Resolver cleenux cleenux EyeWitness EyeWitness Useful commands Alias Command Description alias notepad++ &quot;C:\\Windows\\rwc\\Ninjustu-win-command.cmd&quot; To open &amp; Edit Aliases. q exit To close terminal. c clear To clear screen terminal. e exit Same as above but only show files that don’t contain the string. wget wget -c To Download File with Wget digg dig any +noauthority +noadditional +noqr +nostats +noidentify +nocmd +noquestion +nocomments To display all DNS record types p2 python2 -m pip install ‘ To install Python 2.7 packages or modules from the Python p3 python3 -m pip install ‘To install Python 3.8 packages or modules from the Python p37 python37 -m pip install ‘To install Python 3.7 packages or modules from the Python p38 python3 ‘python 3.8’ command python3 C:\\Python38\\python3.exe ‘python 3.8’ command python2 C:\\Python27\\python2.exe ‘python 2.7’ command python C:\\Python27\\python.exe ‘python 2.7’ command nn notepad++ To open notepad++. sudo runas /user:administrator To run application as administrator pspath wmic process get processid,parentprocessid,executablepath To finding parent process ID on Windows psg NA To find specific services or applications running on your system nsg NA To determine which program is using a given port in poweroff shutdown /s /t 0 /f To shutdown PC. reboot shutdown /r /t 0 /f To shutdown PC. ifconfig ipconfig To display Information of All Network Interfaces in system myip curl ifconfig.me To display your Public IP Address. myip1 curl ipinfo.io/ip To display your Public IP Address. javar java -Xmx345M -jar To run jar/java application. gs git status gc git clone To Cloning a specific folder gcm git commit -m To commit your changes. ga git add To Add Files To The GIT Index To Be Tracked. gpu git push origin master gco git checkout To checkout a branch Or paths to the working tree. gpl git pull origin master Pull All Files From The Repo. gpush git push origin To Push Changes To The Remote Repository. rm rm -r To delete all files and directories in source directory. rmf rm -rf To delete all files and directories in source directory. cp cp -r To copy all files and directories in source directory. yb youtube-dl --update To update youtube download. mp3 youtube-dl -f bestaudio -x --audio-format mp3 --embed-thumbnail To download any Youtube URL as mp3 bb youtube-dl -f bestvideo+bestaudio To download any Youtube URL with high quality video available . dff diff --suppress-common-lines --side-by-side --ignore-space-change To compare between two files/Directory grip grep -o '[0-9]\\{1,3\\}\\.[0-9]\\{1,3\\}\\.[0-9]\\{1,3\\}\\.[0-9]\\{1,3\\}' To extract IP address from file . gremail grep -E -o -r &quot;[A-Za-z0-9][A-Za-z0-9._%+-]+@[A-Za-z0-9][A-Za-z0-9.-]+\\.[A-Za-z]{2,6}&quot; To extract Email address from binary/file. grpath NA To ectract any path files/Directory from binary/file grsu NA To find suspicious files in bainry/file such as bat,cmd,class,exe,jar,js,jse,SCR,VBE,vbs,reg,ps1,psm1 grex NA To extract Filename from binary/file such as exe grsn NA To extract USERNAME/Password from file/binary grurl NA To Extract all URL from file/binary gruser grep -Po &quot;([a-z0-9\\-._~%!$&amp;'()*+,;=]+@)? To find domain username in file grfind grep -H -n To find any string you are looking for in file/bainry ex : grfind ninja.bat file.txt grfindx grep -H -n To find any string you are looking for in file/bainry ex : grfind ninja.bat file.txt remove-e grep . To remove empty lines from file remove-d NA To Remove dublict line from file findsql-url NA To Scan single URL given from Sql injection findsql-list NA To Scan multiple targets given from Sql injection in a textual file sql-layzy python %sqlmapa% --forms --batch --crawl=15 --threads=10 -u To Scan domain/URL targets from sql injection trans bash &quot;C:\\Windows\\rwc\\rwc-commands\\trans&quot; To translate sentences from any language to English trans-shell bash &quot;C:\\Windows\\rwc\\rwc-commands\\trans -shell -brief&quot; To open Translate Shell to to translate sentences from any language to English trans-file bash &quot;C:\\Windows\\rwc\\rwc-commands\\trans file://&quot; To translate file/text from any language to English fix C:\\Windows\\rwc\\rwc-commands\\ANSICON\\ansicon.exe -p&quot; To fix cmd.exe ASCII/Unicode character trans bash &quot;C:\\Windows\\rwc\\rwc-commands\\trans&quot; To translate sentences from english to English Change Directories Alias Command Description .. cd .. $t ls -Al --color=auto To Change Directories. … cd ../.. $t ls -Al --color=auto To Change Directories. …. cd ../../.. $t ls -Al --color=auto To Change Directories. ….. cd ../../../.. $t ls -Al --color=auto To Change Directories. …… cd ../../../../../.. $t ls -Al --color=auto To Change Directories. …… . cd ../../../../../.. $t ls -Al --color=auto To Change Directories. cd~ cd &quot;%USERPROFILE%&quot; To Change directory to userprofile ‘c:\\Users\\Administrator’ home cd &quot;%USERPROFILE%&quot; To Change directory to userprofile ‘c:\\Users\\Administrator’ priv cd &quot;%USERPROFILE%\\Documents\\Private Zone\\&quot; To Change directory to Private Zone folder. rs cd &quot;%USERPROFILE%\\Documents\\Result\\&quot; To Change directory to Result folder. dt cd &quot;%UserProfile%\\Desktop&quot; To Change directory to Desktop. dl cd &quot;%UserProfile%\\downloads&quot; To Change directory to downloads. doc cd &quot;%UserProfile%\\documents&quot; To Change directory to documents. music cd &quot;%UserProfile%\\pictures&quot; To Change directory to pictures. vid cd &quot;%UserProfile%\\videos&quot; To Change directory to videos. gd cd &quot;%UserProfile%\\&quot;Google Drive\\&quot; To Change directory to Google Drive. db cd &quot;%UserProfile%\\dropbox&quot; To Change directory to dropbox . mg cd &quot;%USERPROFILE%\\Documents\\MEGA&quot; To Change directory to MEGA. doc cd &quot;%USERPROFILE%\\Documents\\MEGAsync Downloads\\&quot; To Change directory to MEGAsync. od cd &quot;%USERPROFILE%\\OneDrive\\&quot; To Change directory to Microsoft oneDrive. www cd &quot;C:\\xampp\\htdocs&quot; To Change directory to htdocs. gr cd &quot;C:\\&quot; To Change directory to htdocs. List commands Alias Command Description ll ls -l --group-directories-first --color=auto To List the contents of files and directories given l ls -m --color=auto To List the contents of files and directories given la ls -Al --color=auto To List the contents of files and directories given lx ls -lXB --color=auto To List the contents of files and directories given lk ls -lSr --color=auto To List the contents of files and directories given lc ls -ltcr --color=auto To List the contents of files and directories given lu ls -ltur --color=auto To List the contents of files and directories given lt ls -ltr --color=auto To List the contents of files and directories given lr ls -lR --color=auto To List the contents of files and directories given Run Software Alias Command Description outlook start outlook To run Microsoft outlook application if u installed in Ninjustu os winword start winword To run Microsoft word application if u installed in Ninjustu os excel start excel To run Microsoft excel application if u installed in Ninjustu os Powerpnt start Powerpnt To run Microsoft Powerpoint application if u installed in Ninjustu os firefox start firefox To run Firefox browser chrome start chrome --ignore-certificate-errors --max_old_space_size=4096 --disable-xss-auditor --enable-devtools-experiments --disable-features=enable-automatic-password-saving To run Google chrome for security testing browser","link":"/guide/index.html"}],"posts":[{"title":"What -Is-Ninjutsu-Project","text":"Ninjutsu ProjectNinjutsu is Penetration testing/Red Teaming based on Windows focused on Penetration Testing, Red Teaming, Android Penetration Testing. It includes a full portable arsenal for security experts, but it also includes pre-configured and installed Android Pentesting Integrated Environmental, In addition, protect your privacy by tweak and customize Windows 10, disable the collection services/Apps to improving your anonymity/performance. SecurityNinjutsu Project includes a full arsenal of security-oriented tools to perform penetration tests, security audits, and more.​ PrivacyNinjutsu includes Proxycap , Shut10, WPD10, and simple Dnscrypt which designed to defend your privacy and your identity. Features Offline Pre-Installed Penetration Testing, Red Teaming, and Android Security Testing Integrated Environment. More than 800 penetration testing tools. Free and Open source Tools. Prefills the commandline. Terminal with many useful features. Customize Windows 10 with powerful tweak and optimize. Protect your privacy by tweak and customize Windows 10. Disable many of the annoying features built into windows. Unwanted Windows components removal. Remove/Disable many Windows programs and services. DonationI love to share my project and it takes me a lot of thought and time. I do it because I know how it’s hard to build a penetration testing environment &amp; I think it’s important to share my knowledge and give back to the community as many have done before me. For everyone who would like to support the Ninjutsu Project, Your support is greatly appreciated to Ninjutsu project and help us develop new versions of the Ninjutsu.There are Paypal/BuymeCoffe button below for give a single donation, You can support my on-going work via monthly instalments by clicking the Patreon button below. Community Twitter : https://twitter.com/ninjutsu_os Telegram : https://t.me/Ninjutsu_os Discord : https://discord.gg/ySmjw9 GitHub : https://github.com/Ninjutsu-OS/Ninjutsu Download :Soon Ninjutsu Team Hasan who is next !! (ninjuts.os [at] Gmail.com) ScreenshotDesktop : Information Gathering Tools Exploitation Tools Red Team Toolkit Android Pentesting Integrated Environmental Web Application PT Tools Context menu (Mouse Right-click Features) ContributorsFeel free to add yourself.","link":"/2020/04/17/What-Is-Ninjutsu-OS/"}],"tags":[],"categories":[]}